ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НоменклатураПоставщиков/ЖБИ_НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_НоменклатураПоставщиков</name>
  <comment>ЖБИ - Номенклатура поставщиков</comment>
  <resources>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОсторожно</name>
    <comment>Осторожно</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаркировкаОбщепринятая</name>
    <comment>Маркировка общепринятая</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширенноеНаименование</name>
    <comment>Расширенное наименование</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативныйДокумент</name>
    <comment>Норматив. документ</comment>
    <type>
      <types>CatalogRef.ЖБИ_НормативныеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>НормаАвто</name>
    <comment>Норма погрузки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Качество</name>
    <comment>Качество</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <comment>Вес, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Объем м3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <comment>Длина мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрММ</name>
    <comment>Диаметр мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтверстиеММ</name>
    <comment>Отверстие, мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВх</name>
    <comment>Диаметр вх. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВых</name>
    <comment>Диаметр вых. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочаяДлина</name>
    <comment>Рабочая длин. мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаСтенки</name>
    <comment>Толщина стенки мм.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Глубина</name>
    <comment>Глубина, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМакс</name>
    <comment>Шир. макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМин</name>
    <comment>Шир. мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМакс</name>
    <comment>Высота, макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМин</name>
    <comment>Высота, мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Армирование</name>
    <comment>Армирование</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БетонВ</name>
    <comment>Бетон, В</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВодонепрW</name>
    <comment>Водонепр. W</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МорозF</name>
    <comment>Мороз. F</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертифицированДо</name>
    <comment>Сертифицирован до</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КолВУпаковке</name>
    <comment>Кол-во в упаковке, шт</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесАвто</name>
    <comment>Вес в авто, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <comment>Направление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Коментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мощность</name>
    <comment>Производственные мощности, шт./м2</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаПаузе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <comment>Дата обновления</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="09a12ed1-441d-49a8-9f36-2093735e8d37">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЖБИ_ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_АртикулДляСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ЕстьСертификатТаможенногоСоюза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ЕстьНаСкладе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ОписаниеГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_ОписаниеГруппы1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="344b6917-b413-4fae-aadd-d62836822de6">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3ebfaae7-710d-4b97-aff3-149de91a4f89">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c122409e-0e2f-4354-a036-4e8f6440b616">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/НоменклатураПоставщиков/НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖБИ_НеИспользуется</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НоменклатураПоставщиков/Forms/ФормаСпискаСтарая/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Функция ПолучитьПустуюСтруктуруНаборЗаписейСервер()
	
	СтруктураНабораЗаписей = РегистрыСведений.ЖБИ_НоменклатураПоставщиков.ПолучитьПустуюСтруктуруНаборЗаписей();
	
	Возврат СтруктураНабораЗаписей;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОтборыСпискаПоУмолчанию()
	
	Список.Отбор.Элементы.Очистить();
	//Поставщик
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.Партнеры.ПустаяСсылка();
	ЭлементОтбора.Использование = Ложь;
	
	////Негабарит
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Негабаритный");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение = Ложь;
	//ЭлементОтбора.Использование = Ложь;
	
	//Артикул
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Артикул");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = "";
	ЭлементОтбора.Использование = Ложь;
	
	//МаркировкаОбщепринятая
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МаркировкаОбщепринятая");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЭлементОтбора.ПравоеЗначение = "";
	ЭлементОтбора.Использование = Ложь;
	
	//Номенклатура
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.Номенклатура.ПустаяСсылка();
	ЭлементОтбора.Использование = Ложь;
	
	//НоменклатураПоставщика
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НоменклатураПоставщика");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.НоменклатураПоставщиков.ПустаяСсылка();
	ЭлементОтбора.Использование = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура КомандаНастройкиОтборовПоУмолчанию(Команда)
	ЗаполнитьОтборыСпискаПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда 
		ТекДанные = ЖБИ_ОбщийМодульКлиентСервер.ПроверитьТекСтрокуНаДоступность(ЭтаФорма,"Список");
		Если ТекДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		СтруктураНабораЗаписей = ПолучитьПустуюСтруктуруНаборЗаписейСервер();
		ЗаполнитьЗначенияСвойств(СтруктураНабораЗаписей,ТекДанные); 
		
		Отказ = Истина;
		
		ОткрытьФорму("РегистрСведений.ЖБИ_НоменклатураПоставщиков.Форма.ФормаСозданияНоменклатуруПоставщика",
		СтруктураНабораЗаписей,
		ЭтаФорма,,,,
		Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, "ДобавитьНоменклатуруПоставщикаКопированием"),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьДоступностьКоманд()	
	Если НЕ ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_ОсновнаяРоль") Тогда
		Если ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_ОтделСбыта")
			ИЛИ ЖБИ_ОбщийМодульДокументыСервер.ОпределитьДоступностьРоли("ЖБИ_НачальникОтделаСбыта") Тогда			
			Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюИзменить.Доступность 		= Ложь;
			//Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюСкопировать.Доступность 	= Ложь;
			//Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюУдалить.Доступность 		= Ложь;
		Иначе 
			//КоманднаяПанель.ПодчиненныеЭлементы.ФормаСкопировать.Доступность									= Ложь;
			КоманднаяПанель.ПодчиненныеЭлементы.ФормаИзменить.Доступность										= Ложь;
			КоманднаяПанель.ПодчиненныеЭлементы.ФормаУдалить.Доступность										= Ложь;
			КоманднаяПанель.ПодчиненныеЭлементы.ФормаВывестиСписок.Доступность									= Ложь;
			
			//Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюСкопировать.Доступность 	= Ложь;
			Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюИзменить.Доступность 		= Ложь;			
			Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.СписокКонтекстноеМенюУдалить.Доступность 		= Ложь;	
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормыИнформацию()
	
	//Доступность команд
	ОпределитьДоступностьКоманд();
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ЗаполнитьОтборыСпискаПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормыИнформацию();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	РезультатВыполнения = Новый Структура("СообщениеОбОшибке","");	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
		Если ДополнительныеПараметры.Свойство("ИмяСобытия")
			И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяСобытия) Тогда
		КонецЕсли;
	КонецЕсли;

	Если ДополнительныеПараметры = "ДобавитьНоменклатуруПоставщикаКопированием" Тогда
		Если Результат = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Если Результат.Свойство("СтруктураНабораЗаписей")
			И ЗначениеЗаполнено(Результат.СтруктураНабораЗаписей) Тогда
			
			СтруктураНабораЗаписей = ПолучитьПустуюСтруктуруНаборЗаписейСервер();
			ЗаполнитьЗначенияСвойств(СтруктураНабораЗаписей,Результат.СтруктураНабораЗаписей);
			СтруктураНабораЗаписей.Вставить("ЭтоКопирование", Истина);
			
			ОткрытьФорму("РегистрСведений.ЖБИ_НоменклатураПоставщиков.Форма.ФормаЗаписи",
			СтруктураНабораЗаписей,
			ЭтаФорма,,,,
			Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, "ДобавитьНоменклатуруПоставщикаКопированиемЗавершение"),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ДополнительныеПараметры = "ДобавитьНоменклатуруПоставщикаКопированиемЗавершение" Тогда
			Элементы.Список.Обновить();	
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
